#include <iostream>

int main()
{
    // 引用的含义
    std::cout << "引用本身就是给变量起了个别的名字，对引用的操作就是对变量的操作" << std::endl;
    int i1 = 100;
    int &r = i1;    //  r等于是变量i1的别名
    r = 10;         //  操作引用，等于操作变量
    std::cout << "\n原变量值为 : " << 100
              << "\n对引用进行赋值,此时引用的值为 : " << r
              << "\n原变量的值变为 : " << i1
              << std::endl; 

    //  int &r = i1 与 int& r = i1 这两种引用方式是等价的，没什么不同

    std::cout << "\n==== 引用的基本特征 ====" << std::endl;

    /*
        对引用的任何操作实际上就是对其引用对象的操作
    */

    std::cout << "\n 1、必须初始化,且无法重新绑定" << std::endl;
    int i2 = 100;
    int i3 = 200;
    int& r1 = i2;
    // int& r2;     如果不给予引用初始值，则会报错

    r1 = i3;        //  这是赋值操作，将i3的值赋予引用，同时赋予i2

    std::cout << "\n令'r1 = i3'后，此时引用的值为 : " << r1
              << "\n变量i2的值为 : " << i2
              << std::endl;

    i2 = 1000;

    std::cout << "\ni2变化后,引用的值为 : " << r1
              << "\nr1的值依旧是随i2的变化而变化,说明绑定对象没变"
              << std::endl;

    // 所以，引用在绑定了一个变量后，便无法再更换引用的对象，且引用自存在起便必须绑定对象
    // 或者说引用就是依附于引用对象而存在的

    std::cout << "\n2、引用不是对象,没有独立的内存" << std::endl;

    int i4 = 10;
    int& r2 = i4;

    // 查询内存
    std::cout << "\n查询内存地址 : " << std::endl;
    std::cout << "变量i4的内存地址为 : " << &i4 << std::endl;   // 在这里，&和引用无关，是一个查询内存地址的作用
    std::cout << "引用r2的内存地址为 : " << &r2 << std::endl;   // 内存地址和i4一样

    std::cout << "\n查询内存大小 : " << std::endl;
    std::cout << "变量i4的内存大小为 : " << sizeof(i4) << "字节" << std::endl;
    std::cout << "引用r2的内存大小为 : " << sizeof(r2) << "字节" << std::endl;  // 依旧和i4一样

    /*
        内存地址是唯一性的，内存地址一样，说明本身就是同一内存，内存大小也自然相同
        这也符合引用是依附于引用对象而存在，引用对象是什么，引用就是什么
    */

    std::cout << "\n3、不存在引用的引用" << std::endl;

    int i5 = 12;
    int& r3 = i5;
    int& r4 = r3;       // 表面上看，r4是r3的引用，实际上r4依旧是i5的引用，是i5的另外一个名字

    std::cout << "\n变量i5的内存地址为 : " << &i5
              << "\n引用r3的内存地址为 : " << &r3
              << "\n引用r4的内存地址为 : " << &r4
              << std::endl;
    
    std::cout << "无论是r3还是r4,其内存地址都于i5相同,说明其引用对象均为i5" << std::endl;

    std::cout << "\n通过上面三个基本特性,我们能够得出结论 : "
              << "\n任何对引用的操作,都是对其引用对象的操作"
              << std::endl;

    std::cout << "\n==== 引用的类型 ====" << std::endl;

    std::cout << "\n1、左值引用" << std::endl;

    int i6 = 100;
    int& r5 = i6;

    std::cout << "\n左值引用r5的值为 :" << r5 << std::endl;

    std::cout << "\n2、右值引用" << std::endl;

    int&& r6 = 20;
    int&& r7 = 'a';

    std::cout << "\n右值引用r6的值为 : " << r6
              << "\n右值引用r7的值为 : " << r7
              << std::endl;

    /*
        左值为有名字，有地址的值，可以取地址
        右值为临时值、字面量，不可以取地址
    */
    


}