#include <iostream>

int main()
{
    // 初始化方式
    std::cout << "==== 不同类型的初始化 ====" << std::endl;
    
    int i1 = 100;       // 标准初始化
    int i2 = {100};     // 列表初始化
    int i3 {100};       // 列表初始化
    int i4 (100);       // 标准初始化

    std::cout << "\n列表初始化时如果会丢失精度,则会报错 : " << std::endl;

    double d1 = 3.1415926;
    // int i5 = {d1} , i6 {d1};      浮点转整型会丢失小数位精度，所以用列表初始化会报错
    int i7 = d1 , i8 (d1);

    // 默认初始化
    std::cout << "\n不指定初始值则为默认初始化,依据类型存在风险 : " << std::endl;
    int i9;

    //  标识符命名规则
    std::cout << "\n标识符命名规则 : " << std::endl;
    std::cout << "1、最好能体现实际含义\n"
              << "2、标识符一般小写\n"
              << "3、用户自定义类名一般以大写字母开头\n"
              << "4、标识符若由多个单词组成,相互间应该有区分,如用下划线隔开或后单词大写首字母"
              << std::endl;
}